#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
random_uuid.lambda_src_hash: Refreshing state... [id=b1ec8054-faa2-cb53-260a-173b0f19a184]
aws_cloudwatch_event_rule.daily_trigger: Refreshing state... [id=daily-trigger]
aws_sns_topic.covid_table_updated: Refreshing state... [id=arn:aws:sns:us-east-1:564804858012:covid-table-updated]
aws_dynamodb_table.covid-db: Refreshing state... [id=CovidData]
aws_cloudwatch_event_rule.five_minute_trigger: Refreshing state... [id=five-minute-trigger]
aws_iam_role.covid_etl_lambda_role: Refreshing state... [id=covid-etl-lambda-role]
aws_sns_topic_subscription.covid_etl_updated: Refreshing state... [id=arn:aws:sns:us-east-1:564804858012:covid-table-updated:079b5988-9cc4-4754-8e30-4e99909972fa]
aws_lambda_function.covid_etl_lambda_func: Refreshing state... [id=covid_etl_lambda_function]
aws_iam_role_policy.covid_etl_lambda_role_log_policy: Refreshing state... [id=covid-etl-lambda-role:CovidETLLambdaRolePolicy]
aws_iam_role_policy.covid_etl_lambda_role_sns_policy: Refreshing state... [id=covid-etl-lambda-role:CovidETLAllowSNSPermissions]
aws_lambda_permission.allow_cloudwatch_to_call_covid_etl: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.covid_etl_every_five_minutes: Refreshing state... [id=five-minute-trigger-covid_etl_lambda]
aws_cloudwatch_event_target.covid_etl_every_day: Refreshing state... [id=daily-trigger-covid_etl_lambda]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cloudwatch_event_rule.five_minute_trigger has changed
  ~ resource "aws_cloudwatch_event_rule" "five_minute_trigger" {
        id                  = "five-minute-trigger"
        name                = "five-minute-trigger"
      + tags                = {}
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.covid_lambda_package will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "covid_lambda_package"  {
      ~ id                  = "12374f3185188ba98703f4489f31e4b5ef212738" -> (known after apply)
      ~ output_base64sha256 = "8JoX/jFHdX6k4s2LEY5dN1t4g5d8UyqvXAC764A8CAA=" -> (known after apply)
      ~ output_md5          = "b01fa39f7fb91e00a0c8eef31861551c" -> (known after apply)
      ~ output_path         = "b1ec8054-faa2-cb53-260a-173b0f19a184.zip" -> (known after apply)
      ~ output_sha          = "12374f3185188ba98703f4489f31e4b5ef212738" -> (known after apply)
      ~ output_size         = 2615 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_function.covid_etl_lambda_func will be updated in-place
  ~ resource "aws_lambda_function" "covid_etl_lambda_func" {
      ~ filename                       = "b1ec8054-faa2-cb53-260a-173b0f19a184.zip" -> (known after apply)
        id                             = "covid_etl_lambda_function"
      ~ last_modified                  = "2022-03-31T22:47:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "8JoX/jFHdX6k4s2LEY5dN1t4g5d8UyqvXAC764A8CAA=" -> (known after apply)
        tags                           = {}
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # random_uuid.lambda_src_hash must be replaced
-/+ resource "random_uuid" "lambda_src_hash" {
      ~ id      = "b1ec8054-faa2-cb53-260a-173b0f19a184" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "dynamo.py"        = "34ffa39f897d3f4280b4dfd038c2d601" -> "ee78cd1cfb98aa41216c201690b7d974"
          ~ "transform.py"     = "4cac43a9446a07d1f985f96d15cc6956" -> "b66014b0359d3311896f6b0dc037e11c"
            # (4 unchanged elements hidden)
        }
      ~ result  = "b1ec8054-faa2-cb53-260a-173b0f19a184" -> (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @nshipman-io, Action: `pull_request`*